/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Il socket è stato chiuso dal remote peer";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Il tentativo di connessione all’host è scaduto";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "Tentativo di creare il socket da socket FD è fallito. getpeername() fallito";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "L’operazione di lettura ha raggiunto la lunghezza massima impostata";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "L’operazione di lettura è scaduta";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "L’operazione di scrittura è scaduta";

